// Определить четное ли число 

Console.WriteLine("Введите число ");
int A = int.Parse(Console.ReadLine());

if (A % 2 == 0)
{
    Console.WriteLine("число четное ");
}
else
{
    Console.WriteLine("число не четное ");
}